artillery/first_test.yml
config:
  target: "http://httpbin.org/"
  
  phases:
    - duration: 1
      arrivalRate: 1
      name: Artillery First Test by PolF
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post"      
          json:
            username: "Test User"
            password: "Temp Password"