artillery/load_test.yml
config:
  target: "http://httpbin.org/"
  phases:
    - duration: 1800
      arrivalRate: 2
      name: Load Test
    - duration: 300
      arrivalRate: 1
      name: Scalability 1
    - duration: 300
      arrivalRate: 2
      name: Scalability 2
    - duration: 300
      arrivalRate: 3
      name: Scalability 3
    - duration: 300
      arrivalRate: 4
      name: Scalability 4
    - duration: 300
      arrivalRate: 5
      name: Scalability 5
    - duration: 600
      arrivalRate: 6
      name: Stress Test    
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 1000
    conditions:
      - expression: vusers.failed == 0
      - expression: "http.request_rate >= 3 and http.response_time.max < 600"
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post"
          json:
            username: "Test User"
            password: "Temp Password"
          capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.Host"
              as: "host"