artillery/test_csv.yml
config:
  target: "http://httpbin.org/"
  phases:
    - duration: 1
      arrivalRate: 1
      name: Payload test
  payload:
    -
      path: "keywords.csv"
      fields:
        - "keyword1"
        - "keyword2"
      order: sequence
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get?param1={{ **keyword1** }}"
      - post:
          url: "{{ target }}post?param2={{ **keyword2** }}"
          json:
            username: "Test User"
            password: "Temp Password"
          capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.Host"
              as: "host"